tap "minio/stable"
tap "redis/redis"
tap "riscv-software-src/riscv"
brew "brotli"
brew "openssl@3"
brew "cask"
brew "frpc"
brew "fzf"
brew "gdb"
brew "gh"
brew "go"
brew "hdf5"
brew "libpsl"
brew "maven"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "pgvector"
brew "postgresql@18"
brew "python@3.13"
brew "qemu"
brew "riscv64-elf-binutils"
brew "riscv64-elf-gcc"
brew "riscv64-elf-gdb"
brew "smartmontools"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "minio/stable/minio"
brew "riscv-software-src/riscv/riscv-gnu-toolchain"
brew "riscv-software-src/riscv/riscv-isa-sim"
brew "riscv-software-src/riscv/riscv-pk"
brew "riscv-software-src/riscv/riscv-tools"
cask "applite"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hex-fiend"
cask "latest"
cask "libreoffice"
cask "localsend"
cask "mos"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "raycast"
cask "suspicious-package"
cask "syntax-highlight"
cask "tableplus"
cask "upscayl"
cask "zed"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "ms-python.debugpy"
vscode "ms-python.python"
cargo "rustnet-monitor"
